week-01-introduction-to-mathematical-logic/slides.tex
% Created 2023-04-24 Mon 17:10
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{default}
\author{Mathematical Logic Course}
\date{\today}
\title{Week 1: Introduction to Mathematical Logic}
\hypersetup{
 pdfauthor={Mathematical Logic Course},
 pdftitle={Week 1: Introduction to Mathematical Logic},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:org117628a}]{Overview}
\begin{itemize}
\item What is mathematical logic?
\item Propositional logic: syntax and semantics
\item Truth tables and logical equivalences
\item Coding exercises
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org5201563}]{What is Mathematical Logic?}
\begin{itemize}
\item Study of formal systems in logic and mathematics
\item Provides a foundation for understanding mathematical proofs
\item A way to study formal languages and their interpretations
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org6e33fa1}]{Propositional Logic}
\begin{itemize}
\item Basic building blocks: propositions, connectives, and truth values
\item Examples of propositional formulas:
\begin{itemize}
\item \(P\)
\item \(P \land Q\)
\item \(P \lor \neg Q\)
\end{itemize}
\item Syntax: rules for constructing well-formed formulas
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org2145ef3}]{Truth Tables}
\begin{itemize}
\item A way to represent the truth values of propositional formulas
\item Columns represent propositions and connectives
\item Rows represent all possible assignments of truth values
\item Example: truth table for \(P \land Q\)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org10bf711}]{Logical Equivalences}
\begin{itemize}
\item Two formulas are logically equivalent if they have the same truth values
\item Examples of logical equivalences:
\begin{itemize}
\item De Morgan's laws
\item Distributive laws
\item Identity laws
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4260d07}]{Coding Exercises}
\begin{itemize}
\item Implementing truth tables in Python
\item Evaluating logical expressions
\item Exploring logical equivalences
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org524e8ff}]{Summary and Next Steps}
\begin{itemize}
\item We learned the basics of propositional logic
\item Next week: First-order logic and formal systems
\item Coding exercises to reinforce concepts
\end{itemize}
\end{frame}
\end{document}